АлогистикТест2/src/Documents/алк_РапортПропарка/алк_РапортПропарка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_РапортПропарка</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиКамерыГТО</registerRecords>
  <registerRecords>InformationRegister.алк_ВремяПропарки</registerRecords>
  <registerRecords>AccumulationRegister.алк_УчетВремениПропарки</registerRecords>
  <registerRecords>InformationRegister.алк_СтатусПропарки</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиВКамерахПропарки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.алк_СменыШпон</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>КамераПропарки</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.алк_ОперацииПропарки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пропарщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Камеры</name>
    <attributes>
      <name>КамераСсылка</name>
      <type>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаНаНачало</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаНаКонец</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>ПородаНаНачало</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПородаНаКонец</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>СотрНаНачало</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>СотрНаКонец</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрадацияНаНачало</name>
      <type>
        <types>CatalogRef.алк_ГрадацияПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрадацияНаКонец</name>
      <type>
        <types>CatalogRef.алк_ГрадацияПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеНаНачало</name>
      <type>
        <types>EnumRef.алк_ОперацииПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеНаКонец</name>
      <type>
        <types>EnumRef.алк_ОперацииПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокНаНачалоСмены</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоРазгрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеРазгрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеРазгрузкиПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеРазгрузкиПланНаСледующуюСмену</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РазгрузилиОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоЗагрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеЗазрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеЗазрузкиПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеЗазрузкиПланНаСледующуюСмену</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗагрузкаОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПропарки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеПропарки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеПропаркиПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеПропаркиПланНаСледующуюСмену</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокНаКонецСмены</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаДляДвижений</name>
    <attributes>
      <name>Камера</name>
      <type>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
    <attributes>
      <name>Бригада</name>
      <type>
        <types>CatalogRef.алк_СменыШпон</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.алк_ОперацииПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>План</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОжидаемое</name>
      <comment>Для контроля состояния камеры при записо документа</comment>
      <type>
        <types>EnumRef.алк_ОперацииПропарки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Enums/Смены/Смены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Смены</name>
  <enumValues>
    <name>смена_8_20</name>
  </enumValues>
  <enumValues>
    <name>смена_20_8</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_РапортПропарка/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 
	
	#Область ИнтерфейсПечати
	
	// Сформировать печатные формы объектов
	//
	// ВХОДЯЩИЕ:
	//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
	//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
	//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
	//
	// ИСХОДЯЩИЕ:
	//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
	//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
	//
	Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
				
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "алк_РапортПропаркаПечатнаяФорма") Тогда
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "алк_РапортПропаркаПечатнаяФорма", "Алк рапорт пропарка печатная форма", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "алк_РапортПропаркаПечатнаяФорма"));
			
		КонецЕсли;
				
	КонецПроцедуры
	
	// Заполняет список команд печати.
	// 
	// Параметры:
	//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
	//
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
				
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "алк_РапортПропаркаПечатнаяФорма";
		КомандаПечати.Представление = НСтр("ru = 'Рапорт пропарка'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 1;
		
	КонецПроцедуры
	
	// Сформировать печатные формы объектов
	//
	Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
		
		Перем Ошибки;
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		ПервыйДокумент = Истина;
		
		
		Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			Если ИмяМакета = "алк_РапортПропаркаПечатнаяФорма" Тогда
				
				СформироватьРапортПропарка(ТабличныйДокумент, ТекущийДокумент);
				
			КонецЕсли;
						
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		
		Возврат ТабличныйДокумент;
		
	КонецФункции // ПечатнаяФорма()	
	
	Процедура СформироватьРапортПропарка(ТабличныйДокумент, ТекущийДокумент)
				
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	алк_РапортПропаркаКамеры.Ссылка,
		               |	СУММА(алк_РапортПропаркаКамеры.ОстатокНаНачалоСмены) КАК ИтогоОстатокНаНачалоСмены,
		               |	СУММА(алк_РапортПропаркаКамеры.РазгрузилиОбъем) КАК ИтогоРазгрузкаОбъем,
		               |	СУММА(алк_РапортПропаркаКамеры.ЗагрузкаОбъем) КАК ИтогоЗагрузкаОбъем,
		               |	СУММА(алк_РапортПропаркаКамеры.ОстатокНаКонецСмены) КАК ИтогоОстатокНаКонецСмены
		               |ПОМЕСТИТЬ ВТ_ИтогоОбъемПоДокументу
		               |ИЗ
		               |	Документ.алк_РапортПропарка.Камеры КАК алк_РапортПропаркаКамеры
		               |ГДЕ
		               |	алк_РапортПропаркаКамеры.Ссылка = &Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	алк_РапортПропаркаКамеры.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	алк_РапортПропарка.Дата,
		               |	алк_РапортПропарка.Организация,
		               |	алк_РапортПропарка.СтруктурнаяЕдиница,
		               |	алк_РапортПропарка.Бригада,
		               |	алк_РапортПропарка.Участок,
		               |	алк_РапортПропаркаКамеры.НомерСтроки,
		               |	алк_РапортПропаркаКамеры.КамераСсылка,
		               |	алк_РапортПропаркаКамеры.ДлинаНаНачало,
		               |	алк_РапортПропаркаКамеры.ДлинаНаКонец,
		               |	алк_РапортПропаркаКамеры.ПородаНаНачало,
		               |	алк_РапортПропаркаКамеры.ПородаНаКонец,
		               |	алк_РапортПропаркаКамеры.СотрНаНачало КАК СортНаНачало,
		               |	алк_РапортПропаркаКамеры.СотрНаКонец КАК СортНаКонец,
		               |	алк_РапортПропаркаКамеры.ГрадацияНаНачало,
		               |	алк_РапортПропаркаКамеры.ГрадацияНаКонец,
		               |	алк_РапортПропаркаКамеры.СостояниеНаНачало,
		               |	алк_РапортПропаркаКамеры.СостояниеНаКонец,
		               |	алк_РапортПропаркаКамеры.ОстатокНаНачалоСмены,
		               |	алк_РапортПропаркаКамеры.НачалоРазгрузки КАК РазгрузкаНаНачало,
		               |	алк_РапортПропаркаКамеры.ОкончаниеРазгрузки КАК РазгрузкаНаОкончание,
		               |	алк_РапортПропаркаКамеры.РазгрузилиОбъем КАК РазгрузкаОбъем,
		               |	алк_РапортПропаркаКамеры.НачалоЗагрузки КАК ЗагрузкаНаНачало,
		               |	алк_РапортПропаркаКамеры.ОкончаниеЗазрузки КАК ЗагрузкаНаОкончание,
		               |	алк_РапортПропаркаКамеры.ЗагрузкаОбъем,
		               |	алк_РапортПропаркаКамеры.НачалоПропарки КАК ПропаркаНаНачало,
		               |	алк_РапортПропаркаКамеры.ОкончаниеПропарки КАК ПропаркаНаОкончание,
		               |	алк_РапортПропаркаКамеры.ОкончаниеПропаркиПлан КАК ПропаркаНормативное,
		               |	алк_РапортПропаркаКамеры.ОкончаниеПропаркиПланНаСледующуюСмену КАК ПропаркаНормативСледСмены,
		               |	алк_РапортПропаркаКамеры.ОстатокНаКонецСмены,
		               |	алк_РапортПропарка.Пропарщик,
		               |	алк_РапортПропарка.Мастер,
		               |	ВТ_ИтогоОбъемПоДокументу.ИтогоОстатокНаНачалоСмены,
		               |	ВТ_ИтогоОбъемПоДокументу.ИтогоРазгрузкаОбъем,
		               |	ВТ_ИтогоОбъемПоДокументу.ИтогоЗагрузкаОбъем,
		               |	ВТ_ИтогоОбъемПоДокументу.ИтогоОстатокНаКонецСмены
		               |ИЗ
		               |	Документ.алк_РапортПропарка КАК алк_РапортПропарка
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_РапортПропарка.Камеры КАК алк_РапортПропаркаКамеры
		               |		ПО алк_РапортПропарка.Ссылка = алк_РапортПропаркаКамеры.Ссылка
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогоОбъемПоДокументу КАК ВТ_ИтогоОбъемПоДокументу
		               |		ПО алк_РапортПропарка.Ссылка = ВТ_ИтогоОбъемПоДокументу.Ссылка
		               |ГДЕ
		               |	алк_РапортПропарка.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка",ТекущийДокумент);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		Макет = ПолучитьМакет("алк_РапортПропаркаПечатнаяФорма"); 
		
		//выводим заголовок
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок"); 
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовок); 
		//\\
		
		//заполняем шапку рапорта
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		
		ОбластьШапка.Параметры.Заполнить(ТЗ[0]);
				
		ТабличныйДокумент.Вывести(ОбластьШапка); 
		//\\   
		
		//выводим разделитель (пустые поля)
		ОбластьРазделитель = Макет.ПолучитьОбласть("Разделитель"); 
		
		ТабличныйДокумент.Вывести(ОбластьРазделитель); 
		//\\
		
		//выводим шапку таблицы рапорта
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы"); 
		
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы); 
		//\\
		
		//заполняем ТЧ рапорта
		ОбластьТЧСПараметрами = Макет.ПолучитьОбласть("ТЧСПараметрами");
		
		Для Каждого эл ИЗ ТЗ Цикл 
			
			ОбластьТЧСПараметрами.Параметры.Заполнить(эл);
			 
			ТабличныйДокумент.Вывести(ОбластьТЧСПараметрами); 
			
		КонецЦикла;
		//\\
		
		//выводим итого по рапорту
		ОбластьИТОГОТаблицы = Макет.ПолучитьОбласть("ТЧИтог");
		
		ОбластьИТОГОТаблицы.Параметры.Заполнить(ТЗ[0]);
		
		ТабличныйДокумент.Вывести(ОбластьИТОГОТаблицы); 
		//\\
		
		//выводим разделитель (пустые поля)
		ОбластьРазделитель = Макет.ПолучитьОбласть("Разделитель"); 
		
		ТабличныйДокумент.Вывести(ОбластьРазделитель); 
		//\\

		
		//заполняем подвал рапорта
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал"); 
		
		ОбластьПодвал.Параметры.Заполнить(ТЗ[0]);
				
		ТабличныйДокумент.Вывести(ОбластьПодвал); 
		//\\  
		
		//устанавливаем ориентацию и масштаб
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт; 
		
		ТабличныйДокумент.АвтоМасштаб = Истина;
		//\\

		
	КонецПроцедуры  // СформироватьРапортПропарка()	
	
		
	#КонецОбласти

	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаВыгрузкаИзКамерыПропарки, СтруктураДополнительныеСвойства) Экспорт
		
		ТекстЗапроса = ТекстЗапросаДанныеДокумента();     
			
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВыгрузкаИзКамерыПропарки);
		Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
		Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
		         		
		МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиКамерыГТО", МассивРезультатовЗапроса[0].Выгрузить());  
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВремяПропарки", МассивРезультатовЗапроса[1].Выгрузить());

		
	КонецПроцедуры

	#КонецОбласти
	
	
		
	#Область СервисныеПроцедурыИФункции
	
	
		
	Функция ТекстЗапросаДанныеДокумента()
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА алк_РапортПропаркаКамеры.НачалоЗагрузки = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ВЫБОР
		|					КОГДА алк_РапортПропаркаКамеры.Ссылка.Смена = ЗНАЧЕНИЕ(Перечисление.Смены.смена_8_20)
		|						ТОГДА ДОБАВИТЬКДАТЕ(алк_РапортПропаркаКамеры.Ссылка.ДатаСмены, ЧАС, 8)
		|					ИНАЧЕ ДОБАВИТЬКДАТЕ(алк_РапортПропаркаКамеры.Ссылка.ДатаСмены, ЧАС, 20)
		|				КОНЕЦ
		|		ИНАЧЕ алк_РапортПропаркаКамеры.НачалоЗагрузки
		|	КОНЕЦ КАК Период,
		|	алк_РапортПропаркаКамеры.Ссылка КАК Регистратор,
		|	алк_РапортПропаркаКамеры.Ссылка.СтруктурнаяЕдиница,
		|	алк_РапортПропаркаКамеры.КамераСсылка КАК КамераПропарки,
		|	ВЫБОР
		|		КОГДА алк_РапортПропаркаКамеры.НачалоРазгрузки > алк_РапортПропаркаКамеры.НачалоЗагрузки
		|			ТОГДА алк_РапортПропаркаКамеры.ПородаНаНачало
		|		ИНАЧЕ алк_РапортПропаркаКамеры.ПородаНаКонец
		|	КОНЕЦ КАК Порода,
		|	ВЫБОР
		|		КОГДА алк_РапортПропаркаКамеры.НачалоРазгрузки > алк_РапортПропаркаКамеры.НачалоЗагрузки
		|			ТОГДА алк_РапортПропаркаКамеры.ДлинаНаНачало
		|		ИНАЧЕ алк_РапортПропаркаКамеры.ДлинаНаКонец
		|	КОНЕЦ КАК Длина,
		|	ВЫБОР
		|		КОГДА алк_РапортПропаркаКамеры.НачалоРазгрузки > алк_РапортПропаркаКамеры.НачалоЗагрузки
		|			ТОГДА алк_РапортПропаркаКамеры.СотрНаНачало
		|		ИНАЧЕ алк_РапортПропаркаКамеры.СотрНаКонец
		|	КОНЕЦ КАК Сотр,
		|	ВЫБОР
		|		КОГДА алк_РапортПропаркаКамеры.НачалоРазгрузки > алк_РапортПропаркаКамеры.НачалоЗагрузки
		|			ТОГДА алк_РапортПропаркаКамеры.ГрадацияНаНачало
		|		ИНАЧЕ алк_РапортПропаркаКамеры.ГрадацияНаКонец
		|	КОНЕЦ КАК Градация,
		|	алк_РапортПропаркаКамеры.ЗагрузкаОбъем КАК Количество,
		|	&ВидДвиженияПриход КАК ВидДвижения
		|ИЗ
		|	Документ.алк_РапортПропарка.Камеры КАК алк_РапортПропаркаКамеры
		|ГДЕ
		|	алк_РапортПропаркаКамеры.Ссылка = &Ссылка
		|	И алк_РапортПропаркаКамеры.ЗагрузкаОбъем > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА алк_РапортПропаркаКамеры.НачалоРазгрузки = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ВЫБОР
		|					КОГДА алк_РапортПропаркаКамеры.Ссылка.Смена = ЗНАЧЕНИЕ(Перечисление.Смены.смена_8_20)
		|						ТОГДА ДОБАВИТЬКДАТЕ(алк_РапортПропаркаКамеры.Ссылка.ДатаСмены, ЧАС, 8)
		|					ИНАЧЕ ДОБАВИТЬКДАТЕ(алк_РапортПропаркаКамеры.Ссылка.ДатаСмены, ЧАС, 20)
		|				КОНЕЦ
		|		ИНАЧЕ алк_РапортПропаркаКамеры.НачалоРазгрузки
		|	КОНЕЦ,
		|	алк_РапортПропаркаКамеры.Ссылка,
		|	алк_РапортПропаркаКамеры.Ссылка.СтруктурнаяЕдиница,
		|	алк_РапортПропаркаКамеры.КамераСсылка,
		|	ВЫБОР
		|		КОГДА алк_РапортПропаркаКамеры.НачалоРазгрузки < алк_РапортПропаркаКамеры.НачалоЗагрузки
		|			ТОГДА алк_РапортПропаркаКамеры.ПородаНаНачало
		|		ИНАЧЕ алк_РапортПропаркаКамеры.ПородаНаКонец
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА алк_РапортПропаркаКамеры.НачалоРазгрузки < алк_РапортПропаркаКамеры.НачалоЗагрузки
		|			ТОГДА алк_РапортПропаркаКамеры.ДлинаНаНачало
		|		ИНАЧЕ алк_РапортПропаркаКамеры.ДлинаНаКонец
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА алк_РапортПропаркаКамеры.НачалоРазгрузки < алк_РапортПропаркаКамеры.НачалоЗагрузки
		|			ТОГДА алк_РапортПропаркаКамеры.СотрНаНачало
		|		ИНАЧЕ алк_РапортПропаркаКамеры.СотрНаКонец
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА алк_РапортПропаркаКамеры.НачалоРазгрузки < алк_РапортПропаркаКамеры.НачалоЗагрузки
		|			ТОГДА алк_РапортПропаркаКамеры.ГрадацияНаНачало
		|		ИНАЧЕ алк_РапортПропаркаКамеры.ГрадацияНаКонец
		|	КОНЕЦ,
		|	алк_РапортПропаркаКамеры.РазгрузилиОбъем,
		|	&ВидДвиженияРасход
		|ИЗ
		|	Документ.алк_РапортПропарка.Камеры КАК алк_РапортПропаркаКамеры
		|ГДЕ
		|	алк_РапортПропаркаКамеры.Ссылка = &Ссылка
		|	И алк_РапортПропаркаКамеры.РазгрузилиОбъем > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_РапортПропаркаТаблицаДляДвижений.Ссылка.ДатаСмены КАК Период,
		|	алк_РапортПропаркаТаблицаДляДвижений.Ссылка КАК Регистратор,
		|	алк_РапортПропаркаТаблицаДляДвижений.НомерСтроки,
		|	алк_РапортПропаркаТаблицаДляДвижений.Камера КАК КамераПропарки,
		|	алк_РапортПропаркаТаблицаДляДвижений.Состояние,
		|	алк_РапортПропаркаТаблицаДляДвижений.План,
		|	алк_РапортПропаркаТаблицаДляДвижений.ВремяНачала,
		|	алк_РапортПропаркаТаблицаДляДвижений.ВремяОкончания
		|ИЗ
		|	Документ.алк_РапортПропарка.ТаблицаДляДвижений КАК алк_РапортПропаркаТаблицаДляДвижений
		|ГДЕ
		|	алк_РапортПропаркаТаблицаДляДвижений.Ссылка = &Ссылка";
		
		Возврат ТекстЗапроса;
		
	КонецФункции


	
	
	Функция ТекстЗапросаДанныеДокумента0()
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	алк_РапортПропаркаКамеры.Ссылка.Дата КАК Период,
		|	алк_РапортПропаркаКамеры.Ссылка.Организация,
		|	алк_РапортПропаркаКамеры.Ссылка.СтруктурнаяЕдиница,
		|	алк_РапортПропаркаКамеры.КамераПропарки КАК Ячейка,
		|	алк_РапортПропаркаКамеры.Операция,
		|	алк_РапортПропаркаКамеры.ГрадацияПропарки,
		|	РАЗНОСТЬДАТ(алк_РапортПропаркаКамеры.НачалоОперации, алк_РапортПропаркаКамеры.ОкончаниеОперации, СЕКУНДА) КАК ВремяОперации
		|ИЗ
		|	Документ.алк_РапортПропарка.Камеры КАК алк_РапортПропаркаКамеры";
		
		Возврат ТекстЗапроса;
		
	КонецФункции
	
	#КонецОбласти

	
	
#КонецЕсли
